Config/Catalogs/Surveys.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Surveys</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HeaderText</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FooterText</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Questions</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>FeedbackQuestion</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.FeedbackQuestions</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Mandatory</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>LinkedQuestions</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>LinkedFeedbackQuestion</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.FeedbackQuestions</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AnswerForLink</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FeedbackQuestion</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.FeedbackQuestions</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Mandatory</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Enums/AnswerTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>AnswerTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>String</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Number</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Boolean</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>List</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/Surveys/Ext/ManagerModule.bsl
#Region Public

// --------------------------------------------------------------------------------
//
// Parameters:
//  pSurvey	 - CatalogRef.Surveys	 -  Ref
//  pLang	 - CatalogRef.Languages	 -  куа
// 
// Returns:
//  SpreadsheetDocument - SpreadsheetDocument
//
Function GetSurveySpreadsheet(pSurvey, pLang = Undefined) Export
	vSpreadsheet 	= New SpreadsheetDocument;
	vTemplate 		= Catalogs.Surveys.GetTemplate("Survey");
	vDelimiterArea	= vTemplate.GetArea("Delimiter");
	vArea			= vTemplate.GetArea("Header");
	vArea.Parameters.Description 	= cmNStr(pSurvey.Description, pLang);
	vArea.Parameters.HeaderText		= cmNStr(pSurvey.HeaderText, pLang);
	vSpreadsheet.Put(vArea);
	vQuestionID = 1;
	For each vQuestion in pSurvey.Questions Do
		If vQuestion.FeedbackQuestion.AnswerType = Enums.AnswerTypes.String Then
			vArea	= vTemplate.GetArea("RowString");
	        vArea.Parameters.Question 	= String(vQuestionID) + ") " + cmNStr(vQuestion.FeedbackQuestion.QuestionText, pLang);
			vSpreadsheet.Put(vArea);
			vSpreadsheet.Put(vDelimiterArea);
		ElsIf vQuestion.FeedbackQuestion.AnswerType = Enums.AnswerTypes.Number Then
			vArea	= vTemplate.GetArea("RowNumber");
	        vArea.Parameters.Question 	= String(vQuestionID) + ") " + cmNStr(vQuestion.FeedbackQuestion.QuestionText, pLang);
			vSpreadsheet.Put(vArea);
			vSpreadsheet.Put(vDelimiterArea);
		ElsIf vQuestion.FeedbackQuestion.AnswerType = Enums.AnswerTypes.Boolean Then
			vArea	= vTemplate.GetArea("RowBoolean");
	        vArea.Parameters.Question 	= String(vQuestionID) + ") " + cmNStr(vQuestion.FeedbackQuestion.QuestionText, pLang);
			vSpreadsheet.Put(vArea);
			vSpreadsheet.Put(vDelimiterArea);
		ElsIf vQuestion.FeedbackQuestion.AnswerType = Enums.AnswerTypes.List Then
			vArea	= vTemplate.GetArea("RowList");
	        vArea.Parameters.Question 	= String(vQuestionID) + ") " + cmNStr(vQuestion.FeedbackQuestion.QuestionText, pLang);
			vSpreadsheet.Put(vArea);
			vAnswerID = 1;
			For each vAnswer in vQuestion.FeedbackQuestion.AnswerVariants Do
				vArea	= vTemplate.GetArea("RowListAnswer");
	       		vArea.Parameters.Answer 	= String(vAnswerID) + " - " + cmNStr(vAnswer.AnswerText, pLang);
				vSpreadsheet.Put(vArea);
				vAnswerID = vAnswerID + 1;
			EndDo;
			vSpreadsheet.Put(vDelimiterArea);
		EndIf;
		
		vQuestionID = vQuestionID + 1;
	EndDo;
	
	vArea			= vTemplate.GetArea("Footer");
	vArea.Parameters.FooterText		= cmNStr(pSurvey.FooterText, pLang);
	vSpreadsheet.Put(vArea);
	Return vSpreadsheet;
EndFunction

// --------------------------------------------------------------------------------
//
// Parameters:
//  pData			 - CatalogRef	 - Ref
//  pReceiverNode	 - ExchangePlanRef	 - The Receiver node
//
Procedure ExchangePlansRecordChanges(pData, pReceiverNode = Undefined) Export
	ExchangePlansProcessing.ExchangePlansRecordChanges(pData, pData.Hotel, pReceiverNode);
EndProcedure // ExchangePlansRecordChanges

#EndRegion
